In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 5GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/titanic/train.csv
/kaggle/input/titanic/gender_submission.csv
/kaggle/input/titanic/test.csv

In [2]:
data_train = pd.read_csv("/kaggle/input/titanic/train.csv")
data_test = pd.read_csv("/kaggle/input/titanic/test.csv")

In [3]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
data_train.drop(["Cabin", "Embarked", "PassengerId", "Ticket"], axis=1, inplace=True)

In [6]:
data_test.drop(["Cabin", "Embarked", "PassengerId", "Ticket"], axis=1, inplace=True)

In [7]:

data_train_ok = data_train[['Age']].apply(lambda x: x.fillna(x.value_counts().index[0]))
data_train_ok

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888  24.0
889  26.0
890  32.0

[891 rows x 1 columns]

In [8]:
data_train_ok.Age.isnull().sum()

0

In [9]:
data_train['Age'] = data_train_ok.astype(str).copy()

In [10]:
data_test_ok = data_test[['Age']].apply(lambda x: x.fillna(x.value_counts().index[0]))
data_test_ok

      Age
0    34.5
1    47.0
2    62.0
3    27.0
4    22.0
..    ...
413  24.0
414  39.0
415  38.5
416  24.0
417  24.0

[418 rows x 1 columns]

In [11]:

data_test_ok.Age.isnull().sum()

0

In [12]:
data_test['Age'] = data_test_ok.astype(str).copy()

In [13]:
data_train.info()
data_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       891 non-null    object
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Fare      891 non-null    float64
dtypes: float64(1), int64(4), object(3)
memory usage: 55.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  418 non-null    int64
 1   Name    418 non-null    object
 2   Sex     418 non-null    object
 3   Age     418 non-null    object
 4   SibSp   418 non-null    int64
 5   Parch   418 non-null    int64
 6   Fare    417 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 23.0+ KB

In [14]:
data_test.merge(data_train, how='outer')

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Survived
0,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,NaN
1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,NaN
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,NaN
3,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,NaN
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,NaN
...,...,...,...,...,...,...,...,...
1304,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,0.0
1305,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,1.0
1306,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,24.0,1,2,23.4500,0.0
1307,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,1.0
1308,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,0.0

In [15]:
s = (data_train.dtypes == 'object')
object_cols = list(s[s].index)

print("Categorical variables:")
print(object_cols)

Categorical variables:
['Name', 'Sex', 'Age']

In [16]:
from sklearn.preprocessing import LabelEncoder

label_data=data_train.copy()
label_encoder=LabelEncoder()
for col in object_cols:
    label_data[col]=label_encoder.fit_transform(label_data[col])

In [17]:
label_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    int64
 3   Sex       891 non-null    int64
 4   Age       891 non-null    int64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Fare      891 non-null    float64
dtypes: float64(1), int64(7)
memory usage: 55.8 KB

In [18]:
from sklearn.model_selection import train_test_split

y = label_data.Survived
X = label_data.drop("Survived", axis=1)

X_train, X_valid, y_train, y_valid = train_test_split(X, y, random_state=0)
print(X_train.shape, y_train.shape, X_valid.shape, y_valid.shape)

(668, 7) (668,) (223, 7) (223,)

In [19]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_absolute_error


model=DecisionTreeRegressor(random_state=1)
model.fit(X_train,y_train)
pred=model.predict(X_valid)

print(mean_absolute_error(y_valid,pred))

0.21973094170403587

In [20]:
from sklearn.metrics import accuracy_score

acc_score = accuracy_score(pred.round(), y_valid) * 100
print("Accuracy Score:", acc_score)

Accuracy Score: 78.02690582959642

In [21]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error

forest_model = RandomForestRegressor(random_state=1)
forest_model.fit(X_train, y_train)
preds = forest_model.predict(X_valid)
print(mean_absolute_error(y_valid, preds))

0.2321076233183856

In [22]:
from sklearn.metrics import accuracy_score

random_forest_acc_score = accuracy_score(preds.round(), y_valid) * 100
print("Accuracy Score:", random_forest_acc_score)

Accuracy Score: 84.30493273542601